FranciscoLlobet/miso2/board/frdmmcxe247/board/pin_mux.h
/*! @name PORTC1 (number 52), PTC1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_RXD_0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_RXD_0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_RXD_0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTC0 (number 53), PTC0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_RXD_1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_RXD_1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_RXD_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTC2 (number 43), PTC2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTC2 (number 43), PTC2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_TXD_0_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTC17 (number 56), PTC17
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_CRS_DV_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_CRS_DV_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_CRS_DV_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTC3 (number 42), PTC3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_PHY_RST_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_PHY_RST_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_PHY_RST_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTC3 (number 42), PTC3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_PHY_RST_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_PHY_RST_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_PHY_RST_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTD11 (number 48), PTD11/FTM2_CH1/FTM2_QD_PHA/ETM_TRACE_D2/MII_RMII_TX_CLK/LPUART2_CTS/QSPI_A_IO0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITENET_DEINIT_MII_RMII_TX_CLK_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_DEINIT_MII_RMII_TX_CLK_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_DEINIT_MII_RMII_TX_CLK_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitENET' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitENET_deinit(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
